

a = [500 1000 2000 3000 3100 3200 3300 3400 3500 3600 3700 3800 3900 4000 4100 4200 4300 5000];

b = [3 3 3 2.7 2.6 2.2 1.9 1.6 1.2 0.9 0.6 0.5 0.2 0.1 0 0 0 0];
 
%plot(a, b, 'b');   %自然状态的画图效果
%hold on;
%第一种，画平滑曲线的方法
%c = polyfit(a, b, 2);  %进行拟合，c为2次拟合后的系数
%d = polyval(c, a, 1);  %拟合后，每一个横坐标对应的值即为d
%plot(a, d, 'r');       %拟合后的曲线
clf;
plot(a, b, '*');       %将每个点 用*画出来
hold on;
%第二种，画平滑曲线的方法

values = spcrv([[a(1) a a(end)];[b(1) b b(end)]],3);
plot(values(1,:),values(2,:), 'g');
title("fir滤波器幅频特性曲线");
xlabel("频率  /Hz");
ylabel("幅度  /V" );